In [6]:
import pandas as pd
 
# making data frame from csv file
data = pd.read_csv("C:\\Users\\rhyth\\Downloads\\nba.csv")
print(data.head(10))
 
# retrieving rows by loc method
row1 = data.loc[[3]]
 
# retrieving rows by iloc method
row2 = data.iloc[[3]]
print(row1)
print('\n\n')
print(row2)

            Name            Team  Number Position   Age Height  Weight  \
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3    R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4  Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0
5   Amir Johnson  Boston Celtics    90.0       PF  29.0    6-9   240.0
6  Jordan Mickey  Boston Celtics    55.0       PF  21.0    6-8   235.0
7   Kelly Olynyk  Boston Celtics    41.0        C  25.0    7-0   238.0
8   Terry Rozier  Boston Celtics    12.0       PG  22.0    6-2   190.0
9   Marcus Smart  Boston Celtics    36.0       PG  22.0    6-4   220.0

             College      Salary
0              Texas   7730337.0
1          Marquette   6796117.0
2  Boston University         NaN
3      Georgia State   1148640.0
4                NaN   5000000.0
5                NaN  12000000.0
6                LSU   1170960.0
7            Gonzaga   2165160.0
8         Louisville   1824360.0
9     Oklahoma State   3431040.0
          Name            Team  Number Position   Age Height  Weight  \
3  R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0

         College     Salary
3  Georgia State  1148640.0



          Name            Team  Number Position   Age Height  Weight  \
3  R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0

         College     Salary
3  Georgia State  1148640.0

In [4]:
import pandas as pd
import numpy as np
data = {'A':[2, 3, 4],
       'B':[5, 6, 7], 
       'C':[8, 9, 10]}
df = pd.DataFrame(data)
df.loc['add'] = df.apply(np.sum, axis = 0)
df

     A   B   C
0    2   5   8
1    3   6   9
2    4   7  10
add  9  18  27

In [16]:
# importing pandas and numpy libraries
import pandas as pd
import numpy as np

# creating and initializing a nested list
values_list = [[15, 2.5, 100], [20, 4.5, 50], [25, 5.2, 80],
			[45, 5.8, 48], [40, 6.3, 70], [41, 6.4, 90], 
			[51, 2.3, 111]]

# creating a pandas dataframe
df = pd.DataFrame(values_list, columns=['Field_1', 'Field_2', 'Field_3'],
				index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])


# Apply function numpy.square() to square
# the values of one row only i.e. row 
# with index name 'd'
df = df.apply(lambda x: np.square(x) if x.name == 'd' else x, axis=1)

df.loc['product'] = df[['Field_1']].apply(np.prod())
# printing dataframe
df

TypeError: prod() missing 1 required positional argument: 'a'

In [19]:
import pandas as pd
# Creating a DataFrame
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
# Creating a new column 'C' derived from 'A' and 'B'
df['C'] = df['A'] + df['B']
df

   A  B  C
0  1  4  5
1  2  5  7
2  3  6  9

In [32]:
# importing pandas as pd
import pandas as pd

# dictionary of lists
dict = {'name': ["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score': [90, 40, 80, 98]}

# creating a dataframe from a dictionary
df = pd.DataFrame(dict)


for i in df.iterrows():
    print(i)

(0, name      aparna
degree       MBA
score         90
Name: 0, dtype: object)
(1, name      pankaj
degree       BCA
score         40
Name: 1, dtype: object)
(2, name      sudhir
degree    M.Tech
score         80
Name: 2, dtype: object)
(3, name      Geeku
degree      MBA
score        98
Name: 3, dtype: object)

In [34]:
import pandas as pd
from numpy.random import randint

dict = {'Name':['Martha', 'Tim', 'Rob', 'Georgia'],
        'Maths':[87, 91, 97, 95],
        'Science':[83, 99, 84, 76]
       }

df = pd.DataFrame(dict)

display(df)

df.loc[3] = ['Amy', 89, 93] 

display(df)

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76

     Name  Maths  Science
0  Martha     87       83
1     Tim     91       99
2     Rob     97       84
3     Amy     89       93

In [7]:
import pandas as pd
from datetime import date
data = pd.date_range('1/1/2011', periods = 10, freq ='M')

print(data)
 
x = pd.Timestamp.now()
x.month, x.year

DatetimeIndex(['2011-01-31', '2011-02-28', '2011-03-31', '2011-04-30',
               '2011-05-31', '2011-06-30', '2011-07-31', '2011-08-31',
               '2011-09-30', '2011-10-31'],
              dtype='datetime64[ns]', freq='M')

(7, 2024)

In [9]:
rng = pd.DataFrame()
rng['date'] = pd.date_range('1/1/2011', periods = 72, freq ='H')
 
# Print the dates in dd-mm-yy format
print(rng[:5])
 
# Create features for year, month, day, hour, and minute
rng['year'] = rng['date'].dt.year
rng['month'] = rng['date'].dt.month
rng['day'] = rng['date'].dt.day
rng['hour'] = rng['date'].dt.hour
rng['minute'] = rng['date'].dt.minute
 
# Print the dates divided into features
rng.head(3)

                 date
0 2011-01-01 00:00:00
1 2011-01-01 01:00:00
2 2011-01-01 02:00:00
3 2011-01-01 03:00:00
4 2011-01-01 04:00:00

                 date  year  month  day  hour  minute
0 2011-01-01 00:00:00  2011      1    1     0       0
1 2011-01-01 01:00:00  2011      1    1     1       0
2 2011-01-01 02:00:00  2011      1    1     2       0

In [14]:
import pandas as pd 
from datetime import time
timestamp = pd.Timestamp.now()
print(timestamp)
unix_time = timestamp.timestamp()
print(unix_time)

2024-07-24 17:55:01.772086
1721843701.772086

In [1]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}
df = pd.DataFrame(data)

# Write the DataFrame to an Excel file
excel_file_path = 'pandasEx.xlsx'
df.to_excel(excel_file_path, index=False, sheet_name='Sheet1')

print(f"Excel file '{excel_file_path}' created with the following data:")
print(df)

Excel file 'pandasEx.xlsx' created with the following data:
      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

In [7]:
import pandas as pd
import numpy as np
s = pd.Series(
    [
        "this is a regular sentence",
        "https://docs.python.org/3/tutorial/index.html",
        np.nan
    ]
)
s

0                       this is a regular sentence
1    https://docs.python.org/3/tutorial/index.html
2                                              NaN
dtype: object

In [8]:
s= s.str.split('t')

0                       [, his is a regular sen, ence]
1    [h, , ps://docs.py, hon.org/3/, u, orial/index...
2                                                  NaN
dtype: object

In [9]:
s.str.join('_')

0    t_h_i_s_ _i_s_ _a_ _r_e_g_u_l_a_r_ _s_e_n_t_e_...
1    h_t_t_p_s_:_/_/_d_o_c_s_._p_y_t_h_o_n_._o_r_g_...
2                                                  NaN
dtype: object